-----------------------------------------------------------------------------
-- |
-- Module      :  Vanda.CFTG.Examples
-- Copyright   :  (c) Technische Universität Dresden 2015
-- License     :  Redistribution and use in source and binary forms, with
--                or without modification, is ONLY permitted for teaching
--                purposes at Technische Universität Dresden AND IN
--                COORDINATION with the Chair of Foundations of Programming.
--
-- Maintainer  :  Toni.Dietze@tu-dresden.de
-- Stability   :  unknown
-- Portability :  portable
-----------------------------------------------------------------------------

module Vanda.CFTG.Examples where


import           Vanda.CFTG.CFTG
import           Vanda.Corpus.TreeTerm (parseTrees)

import           Control.Arrow
import           Data.Function (on)
import           Data.List (deleteFirstsBy, intercalate, nubBy)
import           Data.Tree
import           System.Environment (getArgs)


drawRules :: [Rule String String String] -> String
drawRules = unlines . map drawRule


drawRule :: Rule String String String -> String
drawRule (Rule l vs r)
  = unlines
  $ (lft ++ rght) : map (replicate (length lft) ' ' ++) rghts
  where
    lft = l ++ "(" ++ intercalate ", " vs ++ ")" ++ " → "
    rght : rghts = lines $ drawTreeCompact (toTree id id id r)


languageS :: Ord v => [Rule v String t] -> [(Derivation, SF v' n' t)]
languageS rs = language' rs (N "S" [])


printLanguage :: [(Derivation, SF v String String)] -> IO ()
printLanguage = putStr . unlines . concatMap f
  where f (d, sf)
          = [ drawDerivation d
            , drawTreeCompact (toTree undefined id id sf)
            ]


drawDerivation :: Derivation -> String
drawDerivation
  = unlines
  . map (\ (d, r) -> "rule " ++ show r ++ " at " ++ if null d then "ε" else intercalate "-" (map show d))
  . map (map succ *** succ)


rule :: String -> Int -> String -> Rule String String String
rule l v
  = Rule l ['_' : show i | i <- [1 .. v]]
  . treeToSF
  . chain
  . parseTrees
  where
    -- build a spine to the right
    chain :: [Tree a] -> Tree a
    chain = foldr1 (\ (Node x ts) t -> Node x (ts ++ [t]))


g1 :: [Rule String String String]
g1 =
  [ rule "S"  0 "δ₁{(α, B{(α, α, B}(α, α, δ₂(α, α))))"
  , rule "B{" 3 "B{(α, α, B{(γ(_1), γ(_2), B}(α, α, _3)))"
  , rule "B{" 3 "δ₂(_1, δ₁{(_2, _3))"
  , rule "B}" 3 "B{(α, α, B}(γ(_1), γ(_2), B}(α, α, _3)))"
  , rule "B}" 3 "δ₂(_1, δ₁}(_2, _3))"
  ]


g1trans :: [Rule String String String]
g1trans =
  [ rule "S"  0 "B{(α, α, R}(α))"
  , rule "B{" 3 "L{(B{(γ(_1), γ(_2), R}(_3)))"
  , rule "B{" 3 "δ₁{(α, δ₂(_1, δ₁{(_2, δ₂(α, _3))))"
  , rule "B}" 3 "L{(B}(γ(_1), γ(_2), R}(_3)))"
  , rule "B}" 3 "δ₁{(α, δ₂(_1, δ₁}(_2, δ₂(α, _3))))"
  , rule "L{" 1 "L{(B{(γ(α), γ(α), _1))"
  , rule "L{" 1 "δ₁{(α, δ₂(α, _1))"
  , rule "R}" 1 "B}(γ(α), γ(α), R}(_1))"
  , rule "R}" 1 "δ₁}(α, δ₂(α, _1))"
  ]


g1trans2 :: [Rule String String String]
g1trans2 =
  {-  1 -} [ rule "S"  0 "δ₁{(α, δ₂(α, δ₁{(α, δ₂(α, B}(α, α, α, α)))))"
  {-  2 -} , rule "S"  0 "δ₁{(α, δ₂(α, δ₁{(α, δ₂(α, δ₁}(α, δ₂(α, α))))))"
  {-  3 -} , rule "S"  0 "δ₁{(α, δ₂(α, B{(α, α, α, B}(α, α, α, α))))"
  {-  4 -} , rule "S"  0 "δ₁{(α, δ₂(α, B{(α, α, α, δ₁}(α, δ₂(α, α)))))"

  {-  5 -} , rule "B{" 4 "δ₁{(α, δ₂(γ(_1), δ₁{(γ(_2), δ₂(α, B}(α, α, _3, _4)))))"
  {-  6 -} , rule "B{" 4 "δ₁{(α, δ₂(γ(_1), δ₁{(γ(_2), δ₂(α, δ₁}(α, δ₂(_3, _4))))))"
  {-  7 -} , rule "B{" 4 "δ₁{(α, δ₂(α, B{(γ(_1), γ(_2), α, B}(α, α, _3, _4))))"
  {-  8 -} , rule "B{" 4 "δ₁{(α, δ₂(α, B{(γ(_1), γ(_2), α, δ₁}(α, δ₂(_3, _4)))))"
  {-  9 -} , rule "B{" 4 "B{(α, α, γ(_1), δ₁{(γ(_2), δ₂(α, B}(α, α, _3, _4))))"
  {- 10 -} , rule "B{" 4 "B{(α, α, α, B{(γ(_1), γ(_2), α, B}(α, α, _3, _4)))"
  {- 11 -} , rule "B{" 4 "B{(α, α, α, B{(γ(_1), γ(_2), α, δ₁}(α, δ₂(_3, _4))))"
  {- 12 -} , rule "B{" 4 "B{(α, α, γ(_1), δ₁{(γ(_2), δ₂(α, δ₁}(α, δ₂(_3, _4)))))"

  {- 13 -} , rule "B}" 4 "δ₁{(α, δ₂(γ(_1), δ₁}(γ(_2), δ₂(α, B}(α, α, _3, _4)))))"
  {- 14 -} , rule "B}" 4 "δ₁{(α, δ₂(γ(_1), δ₁}(γ(_2), δ₂(α, δ₁}(α, δ₂(_3, _4))))))"
  {- 15 -} , rule "B}" 4 "δ₁{(α, δ₂(α, B}(γ(_1), γ(_2), α, B}(α, α, _3, _4))))"
  {- 16 -} , rule "B}" 4 "δ₁{(α, δ₂(α, B}(γ(_1), γ(_2), α, δ₁}(α, δ₂(_3, _4)))))"
  {- 17 -} , rule "B}" 4 "B{(α, α, γ(_1), δ₁}(γ(_2), δ₂(α, B}(α, α, _3, _4))))"
  {- 18 -} , rule "B}" 4 "B{(α, α, α, B}(γ(_1), γ(_2), α, B}(α, α, _3, _4)))"
  {- 19 -} , rule "B}" 4 "B{(α, α, α, B}(γ(_1), γ(_2), α, δ₁}(α, δ₂(_3, _4))))"
  {- 20 -} , rule "B}" 4 "B{(α, α, γ(_1), δ₁}(γ(_2), δ₂(α, δ₁}(α, δ₂(_3, _4)))))"
  ]


g2 :: [Rule String String String]
g2 =
  [ rule "S" 0 "A(α, α)"
  , rule "A" 2 "A(A(_1, α), A(_2, α))"
  , rule "A" 2 "σ(_1, _2)"
  ]


g3 :: [Rule String String String]
g3 =
  -- S = start, O = open, L = left, C = close, R = right
  [ rule {- 1 -} "S" 0 "{(α) , O(α, α) , C(α, α) , δ(α) , }(α) , δ(α, α)"

  , rule {- 2 -} "O" 3 "O(α, α) , O(γ(_1), γ(_2)) , C(α, α) , _3"
  , rule {- 3 -} "O" 3 "L(_1, _2) , _3"
  , rule {- 4 -} "L" 3 "L(π(_1), π(_2)) , _3"
  , rule {- 5 -} "L" 3 "δ(_1) , {(_2) , _3"

  , rule {- 6 -} "C" 3 "O(α, α) , C(γ(_1), γ(_2)) , C(α, α) , _3"
  , rule {- 7 -} "C" 3 "R(_1, _2) , _3"
  , rule {- 8 -} "R" 3 "R(π(_1), π(_2)) , _3"
  , rule {- 9 -} "R" 3 "δ(_1) , }(_2) , _3"
  ]


-- does not seem to work
g3trans :: [Rule String String String]
g3trans =
  [ rule {-    -} "S"  0 "S1(α, α)"
--, rule {-    -} "S1" 2 "S1(π(_1), π(_2))"
  , rule {-    -} "S1" 2 "OL(α, α, α, _1) ,  }(_2) ,   δ(α) , }(α) , δ(α, α)"
  , rule {-    -} "S1" 2 "{(α) ,    δ(_1) , CL(_2, α, α, α) , }(α) , δ(α, α)"
  , rule {-    -} "S1" 2 "OL(α, α, α, _1) , CR(_2, α, α, α) , }(α) , δ(α, α)"
  , rule {-    -} "S1" 2 "S2(_1, _2, α, α)"
--, rule {-    -} "S2" 4 "S2(_1, _2, π(_3), π(_4))"
  , rule {-    -} "S2" 4 "{(α) , δ(_1) , {(_2) , δ(_3) , }(_4) , δ(α) , }(α) , δ(α, α)"

  -- _1 and _4 are the chains pushed from outside, _2 and _3 are the original params
  -- OL means original O plus _1 is output leftmost below “{” and _4 rightmost below “δ”
  , rule {-    -} "OL"   5 "OL(_1, α, α, γ(_2)) , CL(γ(_3), α, α, _4) , _5"  -- NTN
  , rule {-    -} "OL"   5 "OL1(_1, _2, _3, _4, α, α) , _5"
--, rule {-    -} "OL1"  7 "OL1(_1, _2, _3, _4, π(_5), π(_6)) , _7"
  , rule {-    -} "OL1"  7 "{(_1) , δ(_5) , {(_6) , δ(γ(_2)), CL(γ(_3), α, α, _4) , _7"  -- TTN
  , rule {-    -} "OL1"  7 "OL2(_1, _2, _3, _4, _5, _6, α, α) , _7"
--, rule {-    -} "OL2"  9 "OL2(_1, _2, _3, _4, _5, _6, π(_7), π(_8)) , _9"
  , rule {-    -} "OL2"  9 "{(_1) , δ(_5) , {(_6) , δ(γ(_2)), {(γ(_3)) , δ(_7) , }(_8) , δ(_4) , _9"  -- TTT
  , rule {-    -} "OL2"  9 "{(_1) , δ(_5) , OL(_6, γ(_2), γ(_3), _7), }(_8) , δ(_4) , _9"  -- TNT
  , rule {-    -} "OL2"  9 "{(_1) , δ(_5) , OL(_6, γ(_2), γ(_3), _7) , CR(_8, α, α, _4) , _9"  -- TNN
  , rule {-    -} "OL2"  9 "OL(_1, _5, _6, γ(_2)), {(γ(_3)) , δ(_7) , }(_8) , δ(_4) , _9"  -- NTT
  , rule {-    -} "OL2"  9 "OL(_1, α, α, _5) , OR(_6, γ(_2), γ(_3), _7) , }(_8) , δ(_4) , _9"  -- NNT
  , rule {-    -} "OL2"  9 "OL(_1, α, α, _5) , OR(_6, γ(_2), γ(_3), _7) , CR(_8, α, α, _4) , _9"  -- NNN

  , rule {-    -} "OR"   5 "OR(_1, α, α, γ(_2)) , CL(γ(_3), α, α, _4) , _5"  -- NTN
  , rule {-    -} "OR"   5 "OR1(_1, _2, _3, _4, α, α) , _5"
--, rule {-    -} "OR1"  7 "OR1(_1, _2, _3, _4, π(_5), π(_6)) , _7"
  , rule {-    -} "OR1"  7 "}(_1) , δ(_5) , {(_6) , δ(γ(_2)), CL(γ(_3), α, α, _4) , _7"  -- TTN
  , rule {-    -} "OR1"  7 "OR2(_1, _2, _3, _4, _5, _6, α, α) , _7"
--, rule {-    -} "OR2"  9 "OR2(_1, _2, _3, _4, _5, _6, π(_7), π(_8)) , _9"
  , rule {-    -} "OR2"  9 "}(_1) , δ(_5) , {(_6) , δ(γ(_2)), {(γ(_3)) , δ(_7) , }(_8) , δ(_4) , _9"  -- TTT
  , rule {-    -} "OR2"  9 "}(_1) , δ(_5) , OL(_6, γ(_2), γ(_3), _7), }(_8) , δ(_4) , _9"  -- TNT
  , rule {-    -} "OR2"  9 "}(_1) , δ(_5) , OL(_6, γ(_2), γ(_3), _7) , CR(_8, α, α, _4) , _9"  -- TNN
  , rule {-    -} "OR2"  9 "OR(_1, _5, _6, γ(_2)), {(γ(_3)) , δ(_7) , }(_8) , δ(_4) , _9"  -- NTT
  , rule {-    -} "OR2"  9 "OR(_1, α, α, _5) , OR(_6, γ(_2), γ(_3), _7) , }(_8) , δ(_4) , _9"  -- NNT
  , rule {-    -} "OR2"  9 "OR(_1, α, α, _5) , OR(_6, γ(_2), γ(_3), _7) , CR(_8, α, α, _4) , _9"  -- NNN

  , rule {-    -} "CL"   5 "OL(_1, α, α, γ(_2)) , CL(γ(_3), α, α, _4) , _5"  -- NTN
  , rule {-    -} "CL"   5 "CL1(_1, _2, _3, _4, α, α) , _5"
--, rule {-    -} "CL1"  7 "CL1(_1, _2, _3, _4, π(_5), π(_6)) , _7"
  , rule {-    -} "CL1"  7 "{(_1) , δ(_5) , {(_6) , δ(γ(_2)), CR(γ(_3), α, α, _4) , _7"  -- TTN
  , rule {-    -} "CL1"  7 "CL2(_1, _2, _3, _4, _5, _6, α, α) , _7"
--, rule {-    -} "CL2"  9 "CL2(_1, _2, _3, _4, _5, _6, π(_7), π(_8)) , _9"
  , rule {-    -} "CL2"  9 "{(_1) , δ(_5) , {(_6) , δ(γ(_2)), }(γ(_3)) , δ(_7) , }(_8) , δ(_4) , _9"  -- TTT
  , rule {-    -} "CL2"  9 "{(_1) , δ(_5) , CL(_6, γ(_2), γ(_3), _7), }(_8) , δ(_4) , _9"  -- TNT
  , rule {-    -} "CL2"  9 "{(_1) , δ(_5) , CL(_6, γ(_2), γ(_3), _7) , CR(_8, α, α, _4) , _9"  -- TNN
  , rule {-    -} "CL2"  9 "OL(_1, _5, _6, γ(_2)), }(γ(_3)) , δ(_7) , }(_8) , δ(_4) , _9"  -- NTT
  , rule {-    -} "CL2"  9 "OL(_1, α, α, _5) , CR(_6, γ(_2), γ(_3), _7) , }(_8) , δ(_4) , _9"  -- NNT
  , rule {-    -} "CL2"  9 "OL(_1, α, α, _5) , CR(_6, γ(_2), γ(_3), _7) , CR(_8, α, α, _4) , _9"  -- NNN

  , rule {-    -} "CR"   5 "OR(_1, α, α, γ(_2)) , CL(γ(_3), α, α, _4) , _5"  -- NTN
  , rule {-    -} "CR"   5 "CR1(_1, _2, _3, _4, α, α) , _5"
--, rule {-    -} "CR1"  7 "CR1(_1, _2, _3, _4, π(_5), π(_6)) , _7"
  , rule {-    -} "CR1"  7 "}(_1) , δ(_5) , {(_6) , δ(γ(_2)), CR(γ(_3), α, α, _4) , _7"  -- TTN
  , rule {-    -} "CR1"  7 "CR2(_1, _2, _3, _4, _5, _6, α, α) , _7"
--, rule {-    -} "CR2"  9 "CR2(_1, _2, _3, _4, _5, _6, π(_7), π(_8)) , _9"
  , rule {-    -} "CR2"  9 "}(_1) , δ(_5) , {(_6) , δ(γ(_2)), }(γ(_3)) , δ(_7) , }(_8) , δ(_4) , _9"  -- TTT
  , rule {-    -} "CR2"  9 "}(_1) , δ(_5) , CL(_6, γ(_2), γ(_3), _7), }(_8) , δ(_4) , _9"  -- TNT
  , rule {-    -} "CR2"  9 "}(_1) , δ(_5) , CL(_6, γ(_2), γ(_3), _7) , CR(_8, α, α, _4) , _9"  -- TNN
  , rule {-    -} "CR2"  9 "OR(_1, _5, _6, γ(_2)), }(γ(_3)) , δ(_7) , }(_8) , δ(_4) , _9"  -- NTT
  , rule {-    -} "CR2"  9 "OR(_1, α, α, _5) , CR(_6, γ(_2), γ(_3), _7) , }(_8) , δ(_4) , _9"  -- NNT
  , rule {-    -} "CR2"  9 "OR(_1, α, α, _5) , CR(_6, γ(_2), γ(_3), _7) , CR(_8, α, α, _4) , _9"  -- NNN
  ]


-- does not seem to work
g3trans2 :: [Rule String String String]
g3trans2 =
  [ rule {-    -} "S"  0 "S1(α, α)"
--, rule {-    -} "S1" 2 "S1(π(_1), π(_2))"
  , rule {-    -} "S1" 2 "O+L+(α, α, α, _1) ,    }(_2) ,   δ(α) , }(α) , δ(α, α)"
  , rule {-    -} "S1" 2 "   {(α) ,   δ(_1) , C+L+(_2, α, α, α) , }(α) , δ(α, α)"
  , rule {-    -} "S1" 2 "O+L+(α, α, α, _1) , C-X+(_2, α, α, α) , }(α) , δ(α, α)"
  , rule {-    -} "S1" 2 "O+L-(α, α, α, _1) , C+R+(_2, α, α, α) , }(α) , δ(α, α)"
  , rule {-    -} "S1" 2 "S2(_1, _2, α, α)"
--, rule {-    -} "S2" 4 "S2(_1, _2, π(_3), π(_4))"
  , rule {-    -} "S2" 4 "{(α) , δ(_1) , {(_2) , δ(_3) , }(_4) , δ(α) , }(α) , δ(α, α)"

  -- _1 and _4 are the chains pushed from outside, _2 and _3 are the original params
  -- OL means original O plus _1 is output leftmost below “{” and _4 rightmost below “δ”
  , rule {-    -} "O+L+"    5 "O+L+1N(_1, _2, _3, _4, α, α) , _5"
--, rule {-    -} "O+L+1N"  7 "O+L+1N(_1, _2, _3, _4, π(_5), π(_6)) , _7"
  , rule {-    -} "O+L+1N"  7 "O+L+2N(_1, _2, _3, _4, _5, _6, α, α) , _7"
--, rule {-    -} "O+L+2N"  9 "O+L+2N(_1, _2, _3, _4, _5, _6, π(_7), π(_8)) , _9"
  , rule {-    -} "O+L+2N"  9 "O+L+2T(_1, γ(_2), γ(_3), _4, _5, _6, _7, _8) , _9"
--, rule {-    -} "O+L+2T"  9 "O+L+2T(_1, π(_2), π(_3), _4, _5, _6, _7, _8) , _9"
  , rule {-    -} "O+L+2N"  9 "O+L-(_1, α, α, _5) , O+R+(_6,   γ(_2),  γ(_3),    _7) , C-X+(_8, α, α, _4) , _9"  -- NNN
  , rule {-    -} "O+L+2N"  9 "O+L-(_1, α, α, _5) , O+R+(_6,   γ(_2),  γ(_3),    _7) ,    }(_8) ,   δ(_4) , _9"  -- NNT
  , rule {-    -} "O+L+2N"  9 "   {(_1) ,   δ(_5) , O+L+(_6,   γ(_2),  γ(_3),    _7) , C-X+(_8, α, α, _4) , _9"  -- TNN
  , rule {-    -} "O+L+2N"  9 "   {(_1) ,   δ(_5) , O+L+(_6,   γ(_2),  γ(_3),    _7) ,    }(_8) ,   δ(_4) , _9"  -- TNT
  , rule {-    -} "O+L+2T"  9 "O+L-(_1, α, α, _5) ,    }(_6) , δ(_2) , {(_3) , δ(_7) , C-X+(_8, α, α, _4) , _9"  -- NTN
  , rule {-    -} "O+L+2T"  9 "O+L-(_1, α, α, _5) ,    }(_6) , δ(_2) , {(_3) , δ(_7) ,    }(_8) ,   δ(_4) , _9"  -- NTT
  , rule {-    -} "O+L+2T"  9 "   {(_1) ,   δ(_5) ,    {(_6) , δ(_2) , {(_3) , δ(_7) , C-X+(_8, α, α, _4) , _9"  -- TTN
  , rule {-    -} "O+L+2T"  9 "   {(_1) ,   δ(_5) ,    {(_6) , δ(_2) , {(_3) , δ(_7) ,    }(_8) ,   δ(_4) , _9"  -- TTT

  , rule {-    -} "O+L-"    5 "O+L-1N(_1, _2, _3, _4, α, α) , _5"
--, rule {-    -} "O+L-1N"  7 "O+L-1N(_1, _2, _3, _4, π(_5), π(_6)) , _7"
  , rule {-    -} "O+L-1N"  7 "O+L-2N(_1, _2, _3, _4, _5, _6, α, α) , _7"
--, rule {-    -} "O+L-2N"  9 "O+L-2N(_1, _2, _3, _4, _5, _6, π(_7), π(_8)) , _9"
  , rule {-    -} "O+L-1N"  7 "O+L-1T(_1, γ(_2), γ(_3), _4, _5, _6) , _7"
--, rule {-    -} "O+L-1T"  7 "O+L-1T(_1, π(_2), π(_3), _4, _5, _6) , _7"
  , rule {-    -} "O+L-2N"  9 "O+L-2T(_1, γ(_2), γ(_3), _4, _5, _6, _7, _8) , _9"
--, rule {-    -} "O+L-2T"  9 "O+L-2T(_1, π(_2), π(_3), _4, _5, _6, _7, _8) , _9"
  , rule {-    -} "O+L-2N"  9 "O+L-(_1, α, α, _5) , O+R+(_6,   γ(_2),  γ(_3),    _7) , C-X-(_8, α, α, _4) , _9"  -- NNN
  , rule {-    -} "O+L-1N"  7 "O+L-(_1, α, α, _5) , O+R+(_6,   γ(_2),  γ(_3),    _4) , _7"                       -- NNT
  , rule {-    -} "O+L-2N"  9 "   {(_1) ,   δ(_5) , O+L+(_6,   γ(_2),  γ(_3),    _7) , C-X-(_8, α, α, _4) , _9"  -- TNN
  , rule {-    -} "O+L-1N"  7 "   {(_1) ,   δ(_5) , O+L+(_6,   γ(_2),  γ(_3),    _4) , _7"                       -- TNT
  , rule {-    -} "O+L-2T"  9 "O+L-(_1, α, α, _5) ,    }(_6) , δ(_2) , {(_3) , δ(_7) , C-X-(_8, α, α, _4) , _9"  -- NNN
  , rule {-    -} "O+L-1T"  7 "O+L-(_1, α, α, _5) ,    }(_6) , δ(_2) , {(_3) , δ(_4) , _7"                       -- NNT
  , rule {-    -} "O+L-2T"  9 "   {(_1) ,   δ(_5) ,    {(_6) , δ(_2) , {(_3) , δ(_7) , C-X-(_8, α, α, _4) , _9"  -- TNN
  , rule {-    -} "O+L-1T"  7 "   {(_1) ,   δ(_5) ,    {(_6) , δ(_2) , {(_3) , δ(_4) , _7"                       -- TNT

  , rule {-    -} "O+R+"    5 "O+R+1N(_1, _2, _3, _4, α, α) , _5"
--, rule {-    -} "O+R+1N"  7 "O+R+1N(_1, _2, _3, _4, π(_5), π(_6)) , _7"
  , rule {-    -} "O+R+1N"  7 "O+R+2N(_1, _2, _3, _4, _5, _6, α, α) , _7"
--, rule {-    -} "O+R+2N"  9 "O+R+2N(_1, _2, _3, _4, _5, _6, π(_7), π(_8)) , _9"
  , rule {-    -} "O+R+1N"  7 "O+R+1T(_1, γ(_2), γ(_3), _4, _5, _6) , _7"
--, rule {-    -} "O+R+1T"  7 "O+R+1T(_1, π(_2), π(_3), _4, _5, _6) , _7"
  , rule {-    -} "O+R+2N"  9 "O+R+2T(_1, γ(_2), γ(_3), _4, _5, _6, _7, _8) , _9"
--, rule {-    -} "O+R+2T"  9 "O+R+2T(_1, π(_2), π(_3), _4, _5, _6, _7, _8) , _9"
  , rule {-    -} "O+R+2N"  9 "O+R-(_1, α, α, _5) , O+R+(_6,   γ(_2),  γ(_3),    _7) , C-X+(_8, α, α, _4) , _9"  -- NNN
  , rule {-    -} "O+R+2N"  9 "O+R-(_1, α, α, _5) , O+R+(_6,   γ(_2),  γ(_3),    _7) ,    }(_8) ,   δ(_4) , _9"  -- NNT
  , rule {-    -} "O+R+2N"  9 "   }(_1) ,   δ(_5) , O+L+(_6,   γ(_2),  γ(_3),    _7) , C-X+(_8, α, α, _4) , _9"  -- TNN
  , rule {-    -} "O+R+2N"  9 "   }(_1) ,   δ(_5) , O+L+(_6,   γ(_2),  γ(_3),    _7) ,    }(_8) ,   δ(_4) , _9"  -- TNT
  , rule {-    -} "O+R+2T"  9 "O+R-(_1, α, α, _5) ,    }(_6) , δ(_2) , {(_3) , δ(_7) , C-X+(_8, α, α, _4) , _9"  -- NTN
  , rule {-    -} "O+R+2T"  9 "O+R-(_1, α, α, _5) ,    }(_6) , δ(_2) , {(_3) , δ(_7) ,    }(_8) ,   δ(_4) , _9"  -- NTT
  , rule {-    -} "O+R+2T"  9 "   }(_1) ,   δ(_5) ,    {(_6) , δ(_2) , {(_3) , δ(_7) , C-X+(_8, α, α, _4) , _9"  -- TTN
  , rule {-    -} "O+R+2T"  9 "   }(_1) ,   δ(_5) ,    {(_6) , δ(_2) , {(_3) , δ(_7) ,    }(_8) ,   δ(_4) , _9"  -- TTT

  , rule {-    -} "O+R-"    5 "O+R-1N(_1, _2, _3, _4, α, α) , _5"
--, rule {-    -} "O+R-1N"  7 "O+R-1N(_1, _2, _3, _4, π(_5), π(_6)) , _7"
  , rule {-    -} "O+R-1N"  7 "O+R-2N(_1, _2, _3, _4, _5, _6, α, α) , _7"
--, rule {-    -} "O+R-2N"  9 "O+R-2N(_1, _2, _3, _4, _5, _6, π(_7), π(_8)) , _9"
  , rule {-    -} "O+R-1N"  7 "O+R-1T(_1, γ(_2), γ(_3), _4, _5, _6) , _7"
--, rule {-    -} "O+R-1T"  7 "O+R-1T(_1, π(_2), π(_3), _4, _5, _6) , _7"
  , rule {-    -} "O+R-2N"  9 "O+R-2T(_1, γ(_2), γ(_3), _4, _5, _6, _7, _8) , _9"
--, rule {-    -} "O+R-2T"  9 "O+R-2T(_1, π(_2), π(_3), _4, _5, _6, _7, _8) , _9"
  , rule {-    -} "O+R-2N"  9 "O+R-(_1, α, α, _5) , O+R+(_6,   γ(_2),  γ(_3),    _7) , C-X-(_8, α, α, _4) , _9"  -- NNN
  , rule {-    -} "O+R-1N"  7 "O+R-(_1, α, α, _5) , O+R+(_6,   γ(_2),  γ(_3),    _4) , _7"                       -- NNT
  , rule {-    -} "O+R-2N"  9 "   }(_1) ,   δ(_5) , O+L+(_6,   γ(_2),  γ(_3),    _7) , C-X-(_8, α, α, _4) , _9"  -- TNN
  , rule {-    -} "O+R-1N"  7 "   }(_1) ,   δ(_5) , O+L+(_6,   γ(_2),  γ(_3),    _4) , _7"                       -- TNT
  , rule {-    -} "O+R-2T"  9 "O+R-(_1, α, α, _5) ,    }(_6) , δ(_2) , {(_3) , δ(_7) , C-X-(_8, α, α, _4) , _9"  -- NNN
  , rule {-    -} "O+R-1T"  7 "O+R-(_1, α, α, _5) ,    }(_6) , δ(_2) , {(_3) , δ(_4) , _7"                       -- NNT
  , rule {-    -} "O+R-2T"  9 "   }(_1) ,   δ(_5) ,    {(_6) , δ(_2) , {(_3) , δ(_7) , C-X-(_8, α, α, _4) , _9"  -- TNN
  , rule {-    -} "O+R-1T"  7 "   }(_1) ,   δ(_5) ,    {(_6) , δ(_2) , {(_3) , δ(_4) , _7"                       -- TNT


  , rule {-    -} "C+L+"    5 "C+L+1N(_1, _2, _3, _4, α, α) , _5"
--, rule {-    -} "C+L+1N"  7 "C+L+1N(_1, _2, _3, _4, π(_5), π(_6)) , _7"
  , rule {-    -} "C+L+1N"  7 "C+L+2N(_1, _2, _3, _4, _5, _6, α, α) , _7"
--, rule {-    -} "C+L+2N"  9 "C+L+2N(_1, _2, _3, _4, _5, _6, π(_7), π(_8)) , _9"
  , rule {-    -} "C+L+1N"  7 "C+L+1T(_1, γ(_2), γ(_3), _4, _5, _6) , _7"
--, rule {-    -} "C+L+1T"  7 "C+L+1T(_1, π(_2), π(_3), _4, _5, _6) , _7"
  , rule {-    -} "C+L+2N"  9 "C+L+2T(_1, γ(_2), γ(_3), _4, _5, _6, _7, _8) , _9"
--, rule {-    -} "C+L+2T"  9 "C+L+2T(_1, π(_2), π(_3), _4, _5, _6, _7, _8) , _9"
  , rule {-    -} "C+L+2N"  9 "O+L-(_1, α, α, _5) , C+R+(_6,   γ(_2),  γ(_3),    _7) , C-X+(_8, α, α, _4) , _9"  -- NNN
  , rule {-    -} "C+L+2N"  9 "O+L-(_1, α, α, _5) , C+R+(_6,   γ(_2),  γ(_3),    _7) ,    }(_8) ,   δ(_4) , _9"  -- NNT
  , rule {-    -} "C+L+2N"  9 "   {(_1) ,   δ(_5) , C+L+(_6,   γ(_2),  γ(_3),    _7) , C-X+(_8, α, α, _4) , _9"  -- TNN
  , rule {-    -} "C+L+2N"  9 "   {(_1) ,   δ(_5) , C+L+(_6,   γ(_2),  γ(_3),    _7) ,    }(_8) ,   δ(_4) , _9"  -- TNT
  , rule {-    -} "C+L+2T"  9 "O+L-(_1, α, α, _5) ,    }(_6) , δ(_2) , }(_3) , δ(_7) , C-X+(_8, α, α, _4) , _9"  -- NTN
  , rule {-    -} "C+L+2T"  9 "O+L-(_1, α, α, _5) ,    }(_6) , δ(_2) , }(_3) , δ(_7) ,    }(_8) ,   δ(_4) , _9"  -- NTT
  , rule {-    -} "C+L+2T"  9 "   {(_1) ,   δ(_5) ,    {(_6) , δ(_2) , }(_3) , δ(_7) , C-X+(_8, α, α, _4) , _9"  -- TTN
  , rule {-    -} "C+L+2T"  9 "   {(_1) ,   δ(_5) ,    {(_6) , δ(_2) , }(_3) , δ(_7) ,    }(_8) ,   δ(_4) , _9"  -- TTT

  , rule {-    -} "C+L-"    5 "C+L-1N(_1, _2, _3, _4, α, α) , _5"
--, rule {-    -} "C+L-1N"  7 "C+L-1N(_1, _2, _3, _4, π(_5), π(_6)) , _7"
  , rule {-    -} "C+L-1N"  7 "C+L-2N(_1, _2, _3, _4, _5, _6, α, α) , _7"
--, rule {-    -} "C+L-2N"  9 "C+L-2N(_1, _2, _3, _4, _5, _6, π(_7), π(_8)) , _9"
  , rule {-    -} "C+L-1N"  7 "C+L-1T(_1, γ(_2), γ(_3), _4, _5, _6) , _7"
--, rule {-    -} "C+L-1T"  7 "C+L-1T(_1, π(_2), π(_3), _4, _5, _6) , _7"
  , rule {-    -} "C+L-2N"  9 "C+L-2T(_1, γ(_2), γ(_3), _4, _5, _6, _7, _8) , _9"
--, rule {-    -} "C+L-2T"  9 "C+L-2T(_1, π(_2), π(_3), _4, _5, _6, _7, _8) , _9"
  , rule {-    -} "C+L-2N"  9 "O+L-(_1, α, α, _5) , C+R+(_6,   γ(_2),  γ(_3),    _7) , C-X-(_8, α, α, _4) , _9"  -- NNN
  , rule {-    -} "C+L-1N"  7 "O+L-(_1, α, α, _5) , C+R+(_6,   γ(_2),  γ(_3),    _4) , _7"                       -- NNT
  , rule {-    -} "C+L-2N"  9 "   {(_1) ,   δ(_5) , C+L+(_6,   γ(_2),  γ(_3),    _7) , C-X-(_8, α, α, _4) , _9"  -- TNN
  , rule {-    -} "C+L-1N"  7 "   {(_1) ,   δ(_5) , C+L+(_6,   γ(_2),  γ(_3),    _4) , _7"                       -- TNT
  , rule {-    -} "C+L-2T"  9 "O+L-(_1, α, α, _5) ,    }(_6) , δ(_2) , }(_3) , δ(_7) , C-X-(_8, α, α, _4) , _9"  -- NNN
  , rule {-    -} "C+L-1T"  7 "O+L-(_1, α, α, _5) ,    }(_6) , δ(_2) , }(_3) , δ(_4) , _7"                       -- NNT
  , rule {-    -} "C+L-2T"  9 "   {(_1) ,   δ(_5) ,    {(_6) , δ(_2) , }(_3) , δ(_7) , C-X-(_8, α, α, _4) , _9"  -- TNN
  , rule {-    -} "C+L-1T"  7 "   {(_1) ,   δ(_5) ,    {(_6) , δ(_2) , }(_3) , δ(_4) , _7"                       -- TNT

  , rule {-    -} "C+R+"    5 "C+R+1N(_1, _2, _3, _4, α, α) , _5"
--, rule {-    -} "C+R+1N"  7 "C+R+1N(_1, _2, _3, _4, π(_5), π(_6)) , _7"
  , rule {-    -} "C+R+1N"  7 "C+R+2N(_1, _2, _3, _4, _5, _6, α, α) , _7"
--, rule {-    -} "C+R+2N"  9 "C+R+2N(_1, _2, _3, _4, _5, _6, π(_7), π(_8)) , _9"
  , rule {-    -} "C+R+2N"  9 "C+R+2T(_1, γ(_2), γ(_3), _4, _5, _6, _7, _8) , _9"
--, rule {-    -} "C+R+2T"  9 "C+R+2T(_1, π(_2), π(_3), _4, _5, _6, _7, _8) , _9"
  , rule {-    -} "C+R+2N"  9 "O+R-(_1, α, α, _5) , C+R+(_6,   γ(_2),  γ(_3),    _7) , C-X+(_8, α, α, _4) , _9"  -- NNN
  , rule {-    -} "C+R+2N"  9 "O+R-(_1, α, α, _5) , C+R+(_6,   γ(_2),  γ(_3),    _7) ,    }(_8) ,   δ(_4) , _9"  -- NNT
  , rule {-    -} "C+R+2N"  9 "   }(_1) ,   δ(_5) , C+L+(_6,   γ(_2),  γ(_3),    _7) , C-X+(_8, α, α, _4) , _9"  -- TNN
  , rule {-    -} "C+R+2N"  9 "   }(_1) ,   δ(_5) , C+L+(_6,   γ(_2),  γ(_3),    _7) ,    }(_8) ,   δ(_4) , _9"  -- TNT
  , rule {-    -} "C+R+2T"  9 "O+R-(_1, α, α, _5) ,    }(_6) , δ(_2) , }(_3) , δ(_7) , C-X+(_8, α, α, _4) , _9"  -- NTN
  , rule {-    -} "C+R+2T"  9 "O+R-(_1, α, α, _5) ,    }(_6) , δ(_2) , }(_3) , δ(_7) ,    }(_8) ,   δ(_4) , _9"  -- NTT
  , rule {-    -} "C+R+2T"  9 "   }(_1) ,   δ(_5) ,    {(_6) , δ(_2) , }(_3) , δ(_7) , C-X+(_8, α, α, _4) , _9"  -- TTN
  , rule {-    -} "C+R+2T"  9 "   }(_1) ,   δ(_5) ,    {(_6) , δ(_2) , }(_3) , δ(_7) ,    }(_8) ,   δ(_4) , _9"  -- TTT

  , rule {-    -} "C+R-"    5 "C+R-1N(_1, _2, _3, _4, α, α) , _5"
--, rule {-    -} "C+R-1N"  7 "C+R-1N(_1, _2, _3, _4, π(_5), π(_6)) , _7"
  , rule {-    -} "C+R-1N"  7 "C+R-2N(_1, _2, _3, _4, _5, _6, α, α) , _7"
--, rule {-    -} "C+R-2N"  9 "C+R-2N(_1, _2, _3, _4, _5, _6, π(_7), π(_8)) , _9"
  , rule {-    -} "C+R-1N"  7 "C+R-1T(_1, γ(_2), γ(_3), _4, _5, _6) , _7"
--, rule {-    -} "C+R-1T"  7 "C+R-1T(_1, π(_2), π(_3), _4, _5, _6) , _7"
  , rule {-    -} "C+R-2N"  9 "C+R-2T(_1, γ(_2), γ(_3), _4, _5, _6, _7, _8) , _9"
--, rule {-    -} "C+R-2T"  9 "C+R-2T(_1, π(_2), π(_3), _4, _5, _6, _7, _8) , _9"
  , rule {-    -} "C+R-2N"  9 "O+R-(_1, α, α, _5) , C+R+(_6,   γ(_2),  γ(_3),    _7) , C-X-(_8, α, α, _4) , _9"  -- NNN
  , rule {-    -} "C+R-1N"  7 "O+R-(_1, α, α, _5) , C+R+(_6,   γ(_2),  γ(_3),    _4) , _7"                       -- NNT
  , rule {-    -} "C+R-2N"  9 "   }(_1) ,   δ(_5) , C+L+(_6,   γ(_2),  γ(_3),    _7) , C-X-(_8, α, α, _4) , _9"  -- TNN
  , rule {-    -} "C+R-1N"  7 "   }(_1) ,   δ(_5) , C+L+(_6,   γ(_2),  γ(_3),    _4) , _7"                       -- TNT
  , rule {-    -} "C+R-2T"  9 "O+R-(_1, α, α, _5) ,    }(_6) , δ(_2) , }(_3) , δ(_7) , C-X-(_8, α, α, _4) , _9"  -- NNN
  , rule {-    -} "C+R-1T"  7 "O+R-(_1, α, α, _5) ,    }(_6) , δ(_2) , }(_3) , δ(_4) , _7"                       -- NNT
  , rule {-    -} "C+R-2T"  9 "   }(_1) ,   δ(_5) ,    {(_6) , δ(_2) , }(_3) , δ(_7) , C-X-(_8, α, α, _4) , _9"  -- TNN
  , rule {-    -} "C+R-1T"  7 "   }(_1) ,   δ(_5) ,    {(_6) , δ(_2) , }(_3) , δ(_4) , _7"                       -- TNT


  , rule {-    -} "O-X+"    5 "O-X+1N(_1, _2, _3, _4, α, α) , _5"
--, rule {-    -} "O-X+1N"  7 "O-X+1N(_1, _2, _3, _4, π(_5), π(_6)) , _7"
  , rule {-    -} "O-X+1N"  7 "O-X+2N(_1, _2, _3, _4, _5, _6, α, α) , _7"
--, rule {-    -} "O-X+2N"  9 "O-X+2N(_1, _2, _3, _4, _5, _6, π(_7), π(_8)) , _9"
  , rule {-    -} "O-X+1N"  7 "O-X+1T(_1, γ(_2), γ(_3), _4, _5, _6) , _7"
--, rule {-    -} "O-X+1T"  7 "O-X+1T(_1, π(_2), π(_3), _4, _5, _6) , _7"
  , rule {-    -} "O-X+2N"  9 "O-X+2T(_1, γ(_2), γ(_3), _4, _5, _6, _7, _8) , _9"
--, rule {-    -} "O-X+2T"  9 "O-X+2T(_1, π(_2), π(_3), _4, _5, _6, _7, _8) , _9"
  , rule {-    -} "O-X+2N"  9 "O-X-(_1, α, α, _5) , O+R+(_6,   γ(_2),  γ(_3),    _7) , C-X+(_8, α, α, _4) , _9"  -- NNN
  , rule {-    -} "O-X+2N"  9 "O-X-(_1, α, α, _5) , O+R+(_6,   γ(_2),  γ(_3),    _7) ,    }(_8) ,   δ(_4) , _9"  -- NNT
  , rule {-    -} "O-X+1N"  7 "                     O+L+(_1,   γ(_2),  γ(_3),    _5) , C-X+(_6, α, α, _4) , _7"  -- TNN
  , rule {-    -} "O-X+1N"  7 "                     O+L+(_1,   γ(_2),  γ(_3),    _5) ,    }(_6) ,   δ(_4) , _7"  -- TNT
  , rule {-    -} "O-X+2T"  9 "O-X-(_1, α, α, _5) ,    }(_6) , δ(_2) , {(_3) , δ(_7) , C-X+(_8, α, α, _4) , _9"  -- NTN
  , rule {-    -} "O-X+2T"  9 "O-X-(_1, α, α, _5) ,    }(_6) , δ(_2) , {(_3) , δ(_7) ,    }(_8) ,   δ(_4) , _9"  -- NTT
  , rule {-    -} "O-X+1T"  7 "                        {(_1) , δ(_2) , {(_3) , δ(_5) , C-X+(_6, α, α, _4) , _7"  -- TTN
  , rule {-    -} "O-X+1T"  7 "                        {(_1) , δ(_2) , {(_3) , δ(_5) ,    }(_6) ,   δ(_4) , _7"  -- TTT

  , rule {-    -} "O-X-"    5 "O-X-1N(_1, _2, _3, _4, α, α) , _5"
--, rule {-    -} "O-X-1N"  7 "O-X-1N(_1, _2, _3, _4, π(_5), π(_6)) , _7"
  , rule {-    -} "O-X-1N"  7 "O-X-2N(_1, _2, _3, _4, _5, _6, α, α) , _7"
--, rule {-    -} "O-X-2N"  9 "O-X-2N(_1, _2, _3, _4, _5, _6, π(_7), π(_8)) , _9"
  , rule {-    -} "O-X-"    5 "O-X-0T(_1, γ(_2), γ(_3), _4) , _5"
--, rule {-    -} "O-X-0T"  5 "O-X-0T(_1, π(_2), π(_3), _4) , _5"
  , rule {-    -} "O-X-1N"  7 "O-X-1T(_1, γ(_2), γ(_3), _4, _5, _6) , _7"
--, rule {-    -} "O-X-1T"  7 "O-X-1T(_1, π(_2), π(_3), _4, _5, _6) , _7"
  , rule {-    -} "O-X-2N"  9 "O-X-2T(_1, γ(_2), γ(_3), _4, _5, _6, _7, _8) , _9"
--, rule {-    -} "O-X-2T"  9 "O-X-2T(_1, π(_2), π(_3), _4, _5, _6, _7, _8) , _9"
  , rule {-    -} "O-X-2N"  9 "O-X-(_1, α, α, _5) , O+R+(_6,   γ(_2),  γ(_3),    _7) , C-X-(_8, α, α, _4) , _9"  -- NNN
  , rule {-    -} "O-X-1N"  7 "O-X-(_1, α, α, _5) , O+R+(_6,   γ(_2),  γ(_3),    _4) , _7"                       -- NNT
  , rule {-    -} "O-X-1N"  7 "                     O+L+(_1,   γ(_2),  γ(_3),    _5) , C-X-(_6, α, α, _4) , _7"  -- TNN
  , rule {-    -} "O-X-0N"  5 "                     O+L+(_1,   γ(_2),  γ(_3),    _4) , _5"                       -- TNT
  , rule {-    -} "O-X-2T"  9 "O-X-(_1, α, α, _5) ,    }(_6) , δ(_2) , {(_3) , δ(_7) , C-X-(_8, α, α, _4) , _9"  -- NTN
  , rule {-    -} "O-X-1T"  7 "O-X-(_1, α, α, _5) ,    }(_6) , δ(_2) , {(_3) , δ(_4) , _7"                       -- NTT
  , rule {-    -} "O-X-1T"  7 "                        {(_1) , δ(_2) , {(_3) , δ(_5) , C-X-(_6, α, α, _4) , _7"  -- TTN
  , rule {-    -} "O-X-0T"  5 "                        {(_1) , δ(_2) , {(_3) , δ(_4) , _5"                       -- TTT

  , rule {-    -} "C-X+"    5 "C-X+1N(_1, _2, _3, _4, α, α) , _5"
--, rule {-    -} "C-X+1N"  7 "C-X+1N(_1, _2, _3, _4, π(_5), π(_6)) , _7"
  , rule {-    -} "C-X+1N"  7 "C-X+2N(_1, _2, _3, _4, _5, _6, α, α) , _7"
--, rule {-    -} "C-X+2N"  9 "C-X+2N(_1, _2, _3, _4, _5, _6, π(_7), π(_8)) , _9"
  , rule {-    -} "C-X+1N"  7 "C-X+1T(_1, γ(_2), γ(_3), _4, _5, _6) , _7"
--, rule {-    -} "C-X+1T"  7 "C-X+1T(_1, π(_2), π(_3), _4, _5, _6) , _7"
  , rule {-    -} "C-X+2N"  9 "C-X+2T(_1, γ(_2), γ(_3), _4, _5, _6, _7, _8) , _9"
--, rule {-    -} "C-X+2T"  9 "C-X+2T(_1, π(_2), π(_3), _4, _5, _6, _7, _8) , _9"
  , rule {-    -} "C-X+2N"  9 "O-X-(_1, α, α, _5) , C+R+(_6,   γ(_2),  γ(_3),    _7) , C-X+(_8, α, α, _4) , _9"  -- NNN
  , rule {-    -} "C-X+2N"  9 "O-X-(_1, α, α, _5) , C+R+(_6,   γ(_2),  γ(_3),    _7) ,    }(_8) ,   δ(_4) , _9"  -- NNT
  , rule {-    -} "C-X+1N"  7 "                     C+L+(_1,   γ(_2),  γ(_3),    _5) , C-X+(_6, α, α, _4) , _7"  -- TNN
  , rule {-    -} "C-X+1N"  7 "                     C+L+(_1,   γ(_2),  γ(_3),    _5) ,    }(_6) ,   δ(_4) , _7"  -- TNT
  , rule {-    -} "C-X+2T"  9 "O-X-(_1, α, α, _5) ,    }(_6) , δ(_2) , }(_3) , δ(_7) , C-X+(_8, α, α, _4) , _9"  -- NTN
  , rule {-    -} "C-X+2T"  9 "O-X-(_1, α, α, _5) ,    }(_6) , δ(_2) , }(_3) , δ(_7) ,    }(_8) ,   δ(_4) , _9"  -- NTT
  , rule {-    -} "C-X+1T"  7 "                        {(_1) , δ(_2) , }(_3) , δ(_5) , C-X+(_6, α, α, _4) , _7"  -- TTN
  , rule {-    -} "C-X+1T"  7 "                        {(_1) , δ(_2) , }(_3) , δ(_5) ,    }(_6) ,   δ(_4) , _7"  -- TTT

  , rule {-    -} "C-X-"    5 "C-X-1N(_1, _2, _3, _4, α, α) , _5"
--, rule {-    -} "C-X-1N"  7 "C-X-1N(_1, _2, _3, _4, π(_5), π(_6)) , _7"
  , rule {-    -} "C-X-1N"  7 "C-X-2N(_1, _2, _3, _4, _5, _6, α, α) , _7"
--, rule {-    -} "C-X-2N"  9 "C-X-2N(_1, _2, _3, _4, _5, _6, π(_7), π(_8)) , _9"
  , rule {-    -} "C-X-"    5 "C-X-0T(_1, γ(_2), γ(_3), _4) , _5"
--, rule {-    -} "C-X-0T"  5 "C-X-0T(_1, π(_2), π(_3), _4) , _5"
  , rule {-    -} "C-X-1N"  7 "C-X-1T(_1, γ(_2), γ(_3), _4, _5, _6) , _7"
--, rule {-    -} "C-X-1T"  7 "C-X-1T(_1, π(_2), π(_3), _4, _5, _6) , _7"
  , rule {-    -} "C-X-2N"  9 "C-X-2T(_1, γ(_2), γ(_3), _4, _5, _6, _7, _8) , _9"
--, rule {-    -} "C-X-2T"  9 "C-X-2T(_1, π(_2), π(_3), _4, _5, _6, _7, _8) , _9"
  , rule {-    -} "C-X-2N"  9 "O-X-(_1, α, α, _5) , C+R+(_6,   γ(_2),  γ(_3),    _7) , C-X-(_8, α, α, _4) , _9"  -- NNN
  , rule {-    -} "C-X-1N"  7 "O-X-(_1, α, α, _5) , C+R+(_6,   γ(_2),  γ(_3),    _4) , _7"                       -- NNT
  , rule {-    -} "C-X-1N"  7 "                     C+L+(_1,   γ(_2),  γ(_3),    _5) , C-X-(_6, α, α, _4) , _7"  -- TNN
  , rule {-    -} "C-X-0N"  5 "                     C+L+(_1,   γ(_2),  γ(_3),    _4) , _5"                       -- TNT
  , rule {-    -} "C-X-2T"  9 "O-X-(_1, α, α, _5) ,    }(_6) , δ(_2) , }(_3) , δ(_7) , C-X-(_8, α, α, _4) , _9"  -- NTN
  , rule {-    -} "C-X-1T"  7 "O-X-(_1, α, α, _5) ,    }(_6) , δ(_2) , }(_3) , δ(_4) , _7"                       -- NTT
  , rule {-    -} "C-X-1T"  7 "                        {(_1) , δ(_2) , }(_3) , δ(_5) , C-X-(_6, α, α, _4) , _7"  -- TTN
  , rule {-    -} "C-X-0T"  5 "                        {(_1) , δ(_2) , }(_3) , δ(_4) , _5"                       -- TTT
  ]


-- seems to work
g3trans3 :: [Rule String String String]
g3trans3 =
  [ rule {-    -} "S"  0 "S1(α, α)"
  , rule {-    -} "S1" 2 "S1(π(_1), π(_2))"
  , rule {-    -} "S1" 2 "S2(_1, _2, α, α)"
  , rule {-    -} "S2" 4 "S2(_1, _2, π(_3), π(_4))"
  , rule {-    -} "S2" 4 "{(α) , δ(_1) , O(_2, α, α, _3) , C(_4, α, α, α) , }(α) , δ(α, α)"
  , rule {-    -} "S2" 4 "{(α) , δ(_1) , {(_2) ,   δ(_3) , C(_4, α, α, α) , }(α) , δ(α, α)"
  , rule {-    -} "S2" 4 "{(α) , δ(_1) , O(_2, α, α, _3) , }(_4) ,   δ(α) , }(α) , δ(α, α)"
  , rule {-    -} "S2" 4 "{(α) , δ(_1) , {(_2) ,   δ(_3) , }(_4) ,   δ(α) , }(α) , δ(α, α)"

  , rule {-    -} "O"    5 "O1N(_1, _2, _3, _4, α, α) , _5"
  , rule {-    -} "O1N"  7 "O1N(_1, _2, _3, _4, π(_5), π(_6)) , _7"
  , rule {-    -} "O1N"  7 "O2N(_1, _2, _3, _4, _5, _6, α, α) , _7"
  , rule {-    -} "O2N"  9 "O2N(_1, _2, _3, _4, _5, _6, π(_7), π(_8)) , _9"
  , rule {-    -} "O1N"  7 "O1T(_1, γ(_2), γ(_3), _4, _5, _6) , _7"
  , rule {-    -} "O1T"  7 "O1T(_1, π(_2), π(_3), _4, _5, _6) , _7"
  , rule {-    -} "O2N"  9 "O(_1, α, α, _5) , O(_6,   γ(_2),  γ(_3),    _7) , C(_8, α, α, _4) , _9"  -- NNN
  , rule {-    -} "O2N"  9 "O(_1, α, α, _5) , O(_6,   γ(_2),  γ(_3),    _7) , }(_8) ,   δ(_4) , _9"  -- NNT
  , rule {-    -} "O2N"  9 "{(_1) ,   δ(_5) , O(_6,   γ(_2),  γ(_3),    _7) , C(_8, α, α, _4) , _9"  -- TNN
  , rule {-    -} "O2N"  9 "{(_1) ,   δ(_5) , O(_6,   γ(_2),  γ(_3),    _7) , }(_8) ,   δ(_4) , _9"  -- TNT
  , rule {-    -} "O1T"  7 "O(_1, α, α, _2) ,                 {(_3) , δ(_5) , C(_6, α, α, _4) , _7"  -- NTN
  , rule {-    -} "O1T"  7 "O(_1, α, α, _2) ,                 {(_3) , δ(_5) , }(_6) ,   δ(_4) , _7"  -- NTT
  , rule {-    -} "O1T"  7 "{(_1) ,   δ(_2) ,                 {(_3) , δ(_5) , C(_6, α, α, _4) , _7"  -- TTN
  , rule {-    -} "O1T"  7 "{(_1) ,   δ(_2) ,                 {(_3) , δ(_5) , }(_6) ,   δ(_4) , _7"  -- TTT

  , rule {-    -} "C"    5 "C1N(_1, _2, _3, _4, α, α) , _5"
  , rule {-    -} "C1N"  7 "C1N(_1, _2, _3, _4, π(_5), π(_6)) , _7"
  , rule {-    -} "C1N"  7 "C2N(_1, _2, _3, _4, _5, _6, α, α) , _7"
  , rule {-    -} "C2N"  9 "C2N(_1, _2, _3, _4, _5, _6, π(_7), π(_8)) , _9"
  , rule {-    -} "C1N"  7 "C1T(_1, γ(_2), γ(_3), _4, _5, _6) , _7"
  , rule {-    -} "C1T"  7 "C1T(_1, π(_2), π(_3), _4, _5, _6) , _7"
  , rule {-    -} "C2N"  9 "O(_1, α, α, _5) , C(_6,   γ(_2),  γ(_3),    _7) , C(_8, α, α, _4) , _9"  -- NNN
  , rule {-    -} "C2N"  9 "O(_1, α, α, _5) , C(_6,   γ(_2),  γ(_3),    _7) , }(_8) ,   δ(_4) , _9"  -- NNT
  , rule {-    -} "C2N"  9 "{(_1) ,   δ(_5) , C(_6,   γ(_2),  γ(_3),    _7) , C(_8, α, α, _4) , _9"  -- TNN
  , rule {-    -} "C2N"  9 "{(_1) ,   δ(_5) , C(_6,   γ(_2),  γ(_3),    _7) , }(_8) ,   δ(_4) , _9"  -- TNT
  , rule {-    -} "C1T"  7 "O(_1, α, α, _2) ,                 }(_3) , δ(_5) , C(_6, α, α, _4) , _7"  -- NTN
  , rule {-    -} "C1T"  7 "O(_1, α, α, _2) ,                 }(_3) , δ(_5) , }(_6) ,   δ(_4) , _7"  -- NTT
  , rule {-    -} "C1T"  7 "{(_1) ,   δ(_2) ,                 }(_3) , δ(_5) , C(_6, α, α, _4) , _7"  -- TTN
  , rule {-    -} "C1T"  7 "{(_1) ,   δ(_2) ,                 }(_3) , δ(_5) , }(_6) ,   δ(_4) , _7"  -- TTT
  ]


g4 :: [Rule String String String]
g4 =
  [ rule {- 1 -} "S" 0 "δ(α) , A(α, α) , ε(α) , α"
  , rule {- 2 -} "A" 3 "A(α, γ(_1)) , A(γ(_2), α) , _3"
  , rule {- 3 -} "A" 3 "ε(_1) , δ(_2) , _3"
  ]


-- seems to work
g4trans :: [Rule String String String]
g4trans =
  [ rule {- 1 -} "S" 0 "A(α, α, α) , δ(α) , ε(α) , α"
  , rule {- 2 -} "S" 0 "δ(α) , ε(α) , δ(α) , ε(α) , α"
  , rule {- 3 -} "A" 4 "A(_1, α, γ(_2)) , A(α, γ(_3), α) , _4"
  , rule {- 4 -} "A" 4 "A(_1, α, γ(_2)) , δ(α) , ε(γ(_3)) , _4"
  , rule {- 5 -} "A" 4 "δ(_1) , ε(α) , A(γ(_2), γ(_3), α) , _4"
  , rule {- 6 -} "A" 4 "δ(_1) , ε(α) , δ(γ(_2)) , ε(γ(_3)) , _4"
  ]


g5 :: [Rule String String String]
g5 =
  [ rule {- 1 -} "S" 0 "δ(α) , A(α, α) , ε(α) , α"
  , rule {- 2 -} "A" 3 "A(γ(_1), α) , A(α, γ(_2)) , _3"
  , rule {- 3 -} "A" 3 "ε(_1) , δ(_2) , _3"
  ]

g5' :: [Rule String String String]
g5' =
  [ rule {- 1 -} "S" 0 "δ(α) , A(α, α) , ε(α) , α"
  , rule {- 2 -} "A" 3 "A({(_1), α) , A(α, }(_2)) , _3"
  , rule {- 3 -} "A" 3 "ε(_1) , δ(_2) , _3"
  ]

g5'' :: [Rule String String String]
g5'' =
  [ rule {- 1 -} "S" 0 "δ₁(#b) , A(#a, #b) , δ₂(#a) , #"
  , rule {- 2 -} "A" 3 "A(a(_1), #b) , A(#a, b(_2)) , _3"
  , rule {- 3 -} "A" 3 "δ₂(_1) , δ₁(_2) , _3"
  ]

rtg5 :: [RTGRule String String]
rtg5 =
  [ RTGRule "S" "δ" ["A", "E"]
  , RTGRule "G" "γ" ["A"]
  , RTGRule "G" "γ" ["G"]
  , RTGRule "A" "α" []
  , RTGRule "E" "ε" ["G", "0"]
  , RTGRule "0" "δ" ["A", "1"]
  , RTGRule "1" "ε" ["A", "2"]
  , RTGRule "2" "δ" ["G", "3"]
  , RTGRule "3" "ε" ["G", "0"]
  , RTGRule "3" "ε" ["G", "F"]
  , RTGRule "F" "δ" ["A", "H"]
  , RTGRule "H" "ε" ["A", "K"]
  , RTGRule "K" "δ" ["G", "M"]
  , RTGRule "M" "ε" ["A", "A"]
  ]


g6 :: [Rule String String String]
g6 =
  [ rule {-    -} "S" 0 "δ₁(α) , A(α, α) , δ₂(α) , α"
  , rule {-    -} "A" 3 "A({(_1), }(_2)) , _3"
  , rule {-    -} "A" 3 "A(_1, α) , A(α, _2) , _3"
  , rule {-    -} "A" 3 "δ₂(_1) , δ₁(_2) , _3"
  ]



{-
putLanguage $ take 20 (languageS g3) \\ take 100 (languageS g3trans)
putLanguage $ take 20 (languageS g3trans ) \\ take 100 (languageS g3)
-}


main :: IO ()
main = do
  let lkp g = maybe (error $ "unknown grammar: " ++ g) id $ lookup g
            [ ("g1"      , g1      )
            , ("g1trans" , g1trans )
            , ("g1trans2", g1trans2)
            , ("g2"      , g2      )
            , ("g3"      , g3      )
            , ("g3trans" , g3trans )
            , ("g3trans2", g3trans2)
            , ("g3trans3", g3trans3)
            , ("g4"      , g4      )
            , ("g4trans" , g4trans )
            , ("g5"      , g5      )
            , ("g5'"     , g5'     )
            , ("g5''"    , g5''    )
            , ("g6"      , g6      )
            ]
  args <- getArgs
  case args of
    [argG, argC] ->
      printLanguage $ take (read argC) $ languageS $ lkp argG
    [argG1, argC1, argG2, argC2] ->
      printLanguage
        ( deleteFirstsBy
            ((==) `on` snd)
            (nubBy ((==) `on` snd) $ take (read argC1) $ languageS $ lkp argG1)
            (take (read argC2) $ languageS $ lkp argG2)
          :: [(Derivation, SF () String String)]
        )
    _ -> error "Sorry, I do not understand."
